Revit 2024 API
Form.IsAutoCreaseEdge Method
Tell if an edge is an auto-crease on a top/bottom cap face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsAutoCreaseEdge(
	Reference edgeReference
)
Visual Basic
Public Function IsAutoCreaseEdge ( _
	edgeReference As Reference _
) As Boolean
Visual C++
public:
bool IsAutoCreaseEdge(
	Reference^ edgeReference
)
Parameters
edgeReference
Type: Autodesk.Revit.DB.Reference
The reference of the edge to be checked.
See Also
Form Class
Autodesk.Revit.DB Namespace